src/cf/InformationRegisters/СвязиКонтрагентКонтакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СвязиКонтрагентКонтакт</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязьНедействительна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/КонтактныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КонтактныеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭПДляПоиска</Name>
					<Comment>Адрес ЭП для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПривлечения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиПривлеченияПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефонаДляПоиска</Name>
					<Comment>Номер телефона для поиска при вводе по строке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРолей</Name>
					<Comment>Для представления в списках</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИнициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиКонтактныхЛиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СвязиКонтрагентКонтакт/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает новую связь между контактом и контрагентом
//
// Параметры:
//  - Контрагент - СправочникСсылка.Контрагенты
//  - Контакт - СправочникСсылка.КонтактныеЛица
//
Процедура НоваяСвязь(Контрагент, Контакт, Должность = "", Автор = Неопределено, Период = Неопределено, Порядок = 0) Экспорт
	
	СвязиКонтрагента = РегистрыСведений.СвязиКонтрагентКонтакт.СрезПервых(, Новый Структура("Контрагент", Контрагент));
	
	НеобходимоДобавитьНовуюЗапись = Истина;
	
	НоваяЗапись = Новый Структура;
	НоваяЗапись.Вставить("Контрагент", Контрагент);
	НоваяЗапись.Вставить("Контакт", Контакт);
	НоваяЗапись.Вставить("Период", ?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса()));
	НоваяЗапись.Вставить("Должность", Должность);
	НоваяЗапись.Вставить("СвязьНедействительна", Ложь);
	НоваяЗапись.Вставить("Порядок", Порядок);
	
	УстановленнаяСвязь = СвязиКонтрагента.Найти(Контакт, "Контакт");
	Если УстановленнаяСвязь <> Неопределено Тогда
		
		АктуальнаяСвязьКонтрагентКонтакт = РегистрыСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Новый Структура("Контрагент,Контакт", Контрагент, Контакт));
		Если АктуальнаяСвязьКонтрагентКонтакт.Количество() <> 0 Тогда
			НеобходимоДобавитьНовуюЗапись = ЗаписиОтличаются(НоваяЗапись, АктуальнаяСвязьКонтрагентКонтакт[0]);
			ИзмененПорядок = ИзмененПорядокЗаписи(НоваяЗапись, АктуальнаяСвязьКонтрагентКонтакт[0]);
		КонецЕсли;
		
	КонецЕсли;
		
	Если НЕ НеобходимоДобавитьНовуюЗапись И НЕ ИзмененПорядок Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокЗаписи = 0;
	Если СвязиКонтрагента.Количество() <> 0 И УстановленнаяСвязь = Неопределено Тогда
		СвязиКонтрагента.Сортировать("Порядок Возр");
		ПорядокЗаписи = СвязиКонтрагента[СвязиКонтрагента.Количество() - 1].Порядок + 1;
	КонецЕсли;
	Если ЗначениеЗаполнено(Порядок) Тогда
		ПорядокЗаписи = Порядок;
	КонецЕсли;
	
	НоваяЗапись.Вставить("Порядок", ПорядокЗаписи);
	
	Если Автор = Неопределено Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	НоваяЗапись.Вставить("Автор", Автор);
	
	НаборЗаписей = РегистрыСведений.СвязиКонтрагентКонтакт.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(НоваяЗапись.Контрагент);
	НаборЗаписей.Отбор.Контакт.Установить(НоваяЗапись.Контакт);
	
	ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), НоваяЗапись);
	НаборЗаписей.Записать(НЕ НеобходимоДобавитьНовуюЗапись);
	
КонецПроцедуры

Процедура УстановитьНедействительной(Контрагент, Контакты, Период = Неопределено) Экспорт
	
	Если ТипЗнч(Контакты) = Тип("Массив") Тогда
		МассивКонтактов = Контакты;
	Иначе
		МассивКонтактов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Контакты);
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СвязиКонтрагентКонтакт.СоздатьНаборЗаписей();
	АктуальныеСвязи = РегистрыСведений.СвязиКонтрагентКонтакт.СрезПоследних(, Новый Структура("Контрагент", Контрагент));
	
	Для каждого Контакт Из МассивКонтактов Цикл
		АктуальнаяЗапись = АктуальныеСвязи.Найти(Контакт);
		Если АктуальнаяЗапись = Неопределено ИЛИ АктуальнаяЗапись.СвязьНедействительна Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, АктуальнаяЗапись,, "Порядок");
		НоваяЗапись.Период = ?(ЗначениеЗаполнено(Период), Период, ТекущаяДатаСеанса());
		НоваяЗапись.Автор = Пользователи.ТекущийПользователь();
		НоваяЗапись.СвязьНедействительна = Истина;
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры

Процедура ИзменитьПорядок(Контрагент, Контакт, Смещение, ПорядокИзменен, ВключатьНедействительные) Экспорт
	
	СвязиКонтрагента = РегистрыСведений.СвязиКонтрагентКонтакт.СрезПервых(, Новый Структура("Контрагент", Контрагент));
	
	СвязьКонтрагентКонтакт = СвязиКонтрагента.Найти(Контакт, "Контакт");
	ПоследнийЭлементСписка = (СвязьКонтрагентКонтакт.Порядок = СвязиКонтрагента.Количество());
	
	Если СвязьКонтрагентКонтакт = Неопределено ИЛИ (ПоследнийЭлементСписка И Смещение > 0) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактныеЛица.Ссылка КАК Контакт,
	|	СвязиКонтрагентКонтактСрезПервых.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПервых(, Контрагент = &Контрагент) КАК СвязиКонтрагентКонтактСрезПервых
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛица КАК КонтактныеЛица
	|		ПО СвязиКонтрагентКонтактСрезПервых.Контакт = КонтактныеЛица.Ссылка";
	
	Если НЕ ВключатьНедействительные Тогда
		
		Запрос.Текст = Запрос.Текст + " ГДЕ КонтактныеЛица.Недействителен = ЛОЖЬ";
		
		Если Смещение > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И Порядок > &Порядок УПОРЯДОЧИТЬ ПО Порядок ВОЗР";
		Иначе
			Запрос.Текст = Запрос.Текст + " И Порядок < &Порядок  УПОРЯДОЧИТЬ ПО Порядок УБЫВ";
		КонецЕсли;
		
	Иначе
		
		Если Смещение > 0 Тогда
			Запрос.Текст = Запрос.Текст + " ГДЕ Порядок > &Порядок УПОРЯДОЧИТЬ ПО Порядок ВОЗР";
		Иначе
			Запрос.Текст = Запрос.Текст + " ГДЕ Порядок < &Порядок  УПОРЯДОЧИТЬ ПО Порядок УБЫВ";
		КонецЕсли;
		
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Порядок", СвязьКонтрагентКонтакт.Порядок);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Смещение = Выборка.Порядок - СвязьКонтрагентКонтакт.Порядок;
	СвязиКонтрагента.Сортировать("Порядок Возр");
	СвязиКонтрагента.Сдвинуть(СвязьКонтрагентКонтакт, Смещение);
	
	НовыйПорядок = 0;
	НачатьТранзакцию();
	Попытка
		Для каждого Строка Из СвязиКонтрагента Цикл
			НовыйПорядок = НовыйПорядок + 1;
			
			МенеджерЗаписи = РегистрыСведений.СвязиКонтрагентКонтакт.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период = Строка.Период;
			МенеджерЗаписи.Контрагент = Строка.Контрагент;
			МенеджерЗаписи.Контакт = Строка.Контакт;
			МенеджерЗаписи.Прочитать();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Строка);
			МенеджерЗаписи.Порядок = НовыйПорядок;
			МенеджерЗаписи.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
		ПорядокИзменен = Истина;
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаписиОтличаются(НоваяЗапись, АктуальнаяЗапись)
	
	Возврат НоваяЗапись.Должность <> АктуальнаяЗапись.Должность
		ИЛИ НоваяЗапись.СвязьНедействительна <> АктуальнаяЗапись.СвязьНедействительна;
	
КонецФункции

Функция ИзмененПорядокЗаписи(НоваяЗапись, АктуальнаяЗапись)
	
	Возврат НоваяЗапись.Порядок <> АктуальнаяЗапись.Порядок;
	
КонецФункции

#КонецОбласти

#КонецЕсли
